In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame({
    'Hourly_Salary': ['500.00', '10000.00', '200.00', '20.00', np.nan]
})

In [3]:
df['Hourly_Salary'] = pd.to_numeric(df['Hourly_Salary'])

In [4]:
df

   Hourly_Salary
0          500.0
1        10000.0
2          200.0
3           20.0
4            NaN

In [5]:
# In this example we filter the DataFrame by keeping only the values less than 1000; values not meeting the condition are replaced with NaN

filtered_df = df.where(df < 1000)

filtered_df

   Hourly_Salary
0          500.0
1            NaN
2          200.0
3           20.0
4            NaN

In [6]:
# This example filters the DataFrame by replacing values greater than or equal to 1000 witjh 999, while keeping values less than 1000 unchanged

filtered_df_2 = df.where(df < 1000, other=999)
filtered_df_2

   Hourly_Salary
0          500.0
1          999.0
2          200.0
3           20.0
4          999.0

In [7]:
# In this example we are replacing all NaN(missing) values in the DataFrame with 0, leaving all non-null values unchanged
df_where_3 = df.where(df.notnull(), 0)
df_where_3

   Hourly_Salary
0          500.0
1        10000.0
2          200.0
3           20.0
4            0.0

In [8]:
df2 = pd.DataFrame({
    'Running Back': ['Barry Sanders', 'Walter Payton', 'Emmitt Smith', 'Jim Brown'],
    'Career Rushing Yards': [152690, 16726, 18355, 12312],
    'Touchdowns': [99, 110, 164, 106]
})
df2

    Running Back  Career Rushing Yards  Touchdowns
0  Barry Sanders                152690          99
1  Walter Payton                 16726         110
2   Emmitt Smith                 18355         164
3      Jim Brown                 12312         106

In [9]:
# Next, we filter the DataFrame (df2) to keep only the rows where the Career Rusing Yards are less than 100,000, rows that dont meet this condition are filled with NaN

df2.where(df2["Career Rushing Yards"] < 100000)

    Running Back  Career Rushing Yards  Touchdowns
0            NaN                   NaN         NaN
1  Walter Payton               16726.0       110.0
2   Emmitt Smith               18355.0       164.0
3      Jim Brown               12312.0       106.0

In [10]:
# In this example, we keep rows where Touchdowns are at least 99 and Career Rushing Yards are not equal to 18,355. All other rows are replaced with NaN

df2.where((df2["Touchdowns"] >= 99) & (df2["Career Rushing Yards"] != 18355))

    Running Back  Career Rushing Yards  Touchdowns
0  Barry Sanders              152690.0        99.0
1  Walter Payton               16726.0       110.0
2            NaN                   NaN         NaN
3      Jim Brown               12312.0       106.0

In [11]:
# Here we create a boolean filter that marks True for players with fewer than 100 touchdowns and False otherwise

filter1 = df2["Touchdowns"] < 100
filter1

0     True
1    False
2    False
3    False
Name: Touchdowns, dtype: bool

In [12]:
filter2 = df2["Touchdowns"] > 150
filter2

0    False
1    False
2     True
3    False
Name: Touchdowns, dtype: bool

In [13]:
df2.where(filter1 | filter2)

    Running Back  Career Rushing Yards  Touchdowns
0  Barry Sanders              152690.0        99.0
1            NaN                   NaN         NaN
2   Emmitt Smith               18355.0       164.0
3            NaN                   NaN         NaN

In [14]:
# Here we create a new column “touchdown_totals” in df2 that shows the original touchdown count if it’s 100 or more, otherwise it labels the values as “Less Than 100”

df2["touchdown_totals"] = df2["Touchdowns"].where(df2["Touchdowns"] >= 100, other="Less Than 100")
df2

    Running Back  Career Rushing Yards  Touchdowns touchdown_totals
0  Barry Sanders                152690          99    Less Than 100
1  Walter Payton                 16726         110              110
2   Emmitt Smith                 18355         164              164
3      Jim Brown                 12312         106              106